app/views/articles/show.html.erb

SELECT "comments".* FROM "comments" WHERE "comments"."article_id" = $1  [["article_id", 3]]
---
<%= link_to "delete",article_path(@article), method: :delete,  data: {confirm: "Really delete the article?"} %></p>
<h3>Comments (<% @article.comments.size %>)</h3>