app/controllers/articles_controller.rb

INSERT INTO "articles" ("title", "body", "created_at", "updated_at") VALUES ($1, $2, $3, $4) RETURNING "id"  [["title", "This is an article title"], ["body", "This is an article body"], ["created_at", "2015-03-08 20:54:09.679114"], ["updated_at", "2015-03-08 20:54:09.679114"]]
---
  def create
    @article = Article.new(article_params)
    @article.save

SELECT  "articles".* FROM "articles" WHERE "articles"."id" = $1 LIMIT 1  [["id", 3]]
UPDATE "articles" SET "title" = $1, "updated_at" = $2 WHERE "articles"."id" = $3  [["title", "This is yet another new article title2"], ["updated_at", "2015-03-08 21:28:59.227849"], ["id", 3]]
---
  def update
      @article = Article.find(params[:id])
      @article.update(article_params)