app/controllers/comments_controller.rb

  def create
    @commentable = find_commentable
    @comment = @commentable.comments.new(comment_params)
    if @comment.save
---
INSERT INTO "comments" ("author_name", "body", "article_id", "created_at", "updated_at") VALUES ($1, $2, $3, $4, $5) RETURNING "id"  [["author_name", "Testy"], ["body", "Test test test"], ["article_id", 3], ["created_at", "2015-03-08 22:53:41.863343"], ["updated_at", "2015-03-08 22:53:41.863343"]]